zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255fxx_cm0.h
/*
 * @brief Inter-Processor Communication Controller (IPCC)
 */
typedef struct
{
  __IO uint32_t C1CR;            /*!< IPCC Processor 1 control register                 Address offset: 0x000 */
  __IO uint32_t C1MR;            /*!< IPCC Processor 1 mask register                    Address offset: 0x004 */
  __IO uint32_t C1SCR;           /*!< IPCC Processor 1 status set clear register        Address offset: 0x008 */
  __IO uint32_t C1TOC2SR;        /*!< IPCC processor 1 to processor 2 status register   Address offset: 0x00C */
  __IO uint32_t C2CR;            /*!< IPCC Processor 2 control register                 Address offset: 0x010 */
  __IO uint32_t C2MR;            /*!< IPCC Processor 2 mask register                    Address offset: 0x014 */
  __IO uint32_t C2SCR;           /*!< IPCC Processor 2 status set clear register        Address offset: 0x018 */
  __IO uint32_t C2TOC1SR;        /*!< IPCC processor 2 to processor 1 status register   Address offset: 0x01C */
       uint32_t RESERVED0[24];   /*!< Reserved                                          Address offset: 0x020-0x07C */
  __IO uint32_t C1SECCFGR;       /*!< IPCC Processor 1 security configuration register  Address offset: 0x080 */
  __IO uint32_t C1PRIVCFGR;      /*!< IPCC processor 1 privilege configuration register Address offset: 0x084 */
  __IO uint32_t C1CIDCFGR;       /*!< IPCC processor 1 CID configuration register       Address offset: 0x088 */
       uint32_t RESERVED1;       /*!< Reserved                                          Address offset: 0x08C */
  __IO uint32_t C2SECCFGR;       /*!< IPCC processor 2 security configuration register  Address offset: 0x090 */
  __IO uint32_t C2PRIVCFGR;      /*!< IPCC processor 2 privilege configuration register Address offset: 0x094 */
  __IO uint32_t C2CIDCFGR;       /*!< IPCC processor 2 CID configuration register       Address offset: 0x098 */
       uint32_t RESERVED2[213];  /*!< Reserved                                          Address offset: 0x09C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< IPCC Hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< IPCC IP Version register                          Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< IPCC IP Identification register                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< IPCC Size ID register                             Address offset: 0x3FC */
} IPCC_TypeDef;

typedef struct
{
  __IO uint32_t CR;              /*!< Control register                                  Address offset: 0x000 */
  __IO uint32_t MR;              /*!< Mask register                                     Address offset: 0x004 */
  __IO uint32_t SCR;             /*!< Status set clear register                         Address offset: 0x008 */
  __IO uint32_t SR;              /*!< Status register                                   Address offset: 0x00C */
} IPCC_CommonTypeDef;

/*
 * @brief Independent Watchdog (IWDG)
 */
typedef struct
{
  __IO uint32_t KR;              /*!< IWDG key register                    Address offset: 0x000 */
  __IO uint32_t PR;              /*!< IWDG prescaler register              Address offset: 0x004 */
  __IO uint32_t RLR;             /*!< IWDG reload register                 Address offset: 0x008 */
  __IO uint32_t SR;              /*!< IWDG status register                 Address offset: 0x00C */
  __IO uint32_t WINR;            /*!< IWDG window register                 Address offset: 0x010 */
  __IO uint32_t EWCR;            /*!< IWDG early wakeup interrupt register Address offset: 0x014 */
  __IO uint32_t ICR;             /*!< IWDG Interrupt clear register        Address offset: 0x018 */
       uint32_t RESERVED0[245];  /*!< Reserved                             Address offset: 0x01C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< IWDG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< IWDG version register                Address offset: 0x3F4 */
  __IO uint32_t IDR;             /*!< IWDG identification register         Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< IWDG size identification register    Address offset: 0x3FC */
} IWDG_TypeDef;

/*
 * @brief Low power timer (LPTIM)
          IP version is v2_1
 */
typedef struct
{
  __IO uint32_t ISR;             /*!< LPTIM interrupt and status register                 Address offset: 0x000 */
  __IO uint32_t ICR;             /*!< LPTIM interrupt clear register                      Address offset: 0x004 */
  __IO uint32_t DIER;            /*!< LPTIM interrupt enable register                     Address offset: 0x008 */
  __IO uint32_t CFGR;            /*!< LPTIM configuration register                        Address offset: 0x00C */
  __IO uint32_t CR;              /*!< LPTIM control register                              Address offset: 0x010 */
  __IO uint32_t CCR1;            /*!< LPTIM compare register 1                            Address offset: 0x014 */
  __IO uint32_t ARR;             /*!< LPTIM autoreload register                           Address offset: 0x018 */
  __IO uint32_t CNT;             /*!< LPTIM counter register                              Address offset: 0x01C */
  __IO uint32_t OR;              /*!< LPTIM1 option register                              Address offset: 0x020 */
  __IO uint32_t CFGR2;           /*!< LPTIM configuration register 2                      Address offset: 0x024 */
  __IO uint32_t RCR;             /*!< LPTIM repetition register                           Address offset: 0x028 */
  __IO uint32_t CCMR1;           /*!< LPTIM capture/compare mode register 1               Address offset: 0x02C */
       uint32_t RESERVED1;       /*!< Reserved                                            Address offset: 0x030 */
  __IO uint32_t CCR2;            /*!< LPTIM compare register 2                            Address offset: 0x034 */
       uint32_t RESERVED2[237];  /*!< Reserved                                            Address offset: 0x038-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< LPTIM peripheral hardware configuration register 2  Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< LPTIM peripheral hardware configuration register 1  Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< LPTIM peripheral version identification register    Address offset: 0x3F4 */
  __IO uint32_t PIDR;            /*!< LPTIM peripheral type identification register       Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< LPTIM registers map size identification register    Address offset: 0x3FC */
} LPTIM_TypeDef;

/**
  * @brief MDF/ADF
  */
typedef struct
{
 __IO uint32_t GCR;            /*!< MDF Global Control register,             Address offset: 0x00  */
 __IO uint32_t CKGCR;          /*!< MDF Clock Generator Control Register,    Address offset: 0x04  */
 uint32_t     RESERVED1[6];    /*!< Reserved, 0x08-0x1C                                            */
 __IO uint32_t OR;             /*!< MDF  Option Register,                    Address offset: 0x20  */
 uint32_t     RESERVED2[1011]; /*!< Reserved, 0x24-0xFEC                                           */
 __IO uint32_t HWCFGR;         /*!< MDF Hardware Configuration Register,     Address offset:0xFF0  */
 __IO uint32_t VERR;           /*!< MDF Version Register,                    Address offset:0xFF4  */
 __IO uint32_t IPIDR;          /*!< MDF Identification Register,             Address offset:0xFF8  */
 __IO uint32_t SIDR;           /*!< MDF Size Identification Register,        Address offset:0xFFC  */
}MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;         /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;         /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;         /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;       /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;       /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 __IO uint32_t DFLTINTR;       /*!< MDF Integrator Configuration Register,          Address offset: 0x94 */
 __IO uint32_t OLDCR;          /*!< MDF Out-Of Limit Detector Control Register,     Address offset: 0x98 */
 __IO uint32_t OLDTHLR;        /*!< MDF OLD Threshold Low Register,                 Address offset: 0x9C */
 __IO uint32_t OLDTHHR;        /*!< MDF OLD Threshold High Register,                Address offset: 0xA0 */
 __IO uint32_t DLYCR;          /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 __IO uint32_t SCDCR;          /*!< MDF short circuit detector control Register,    Address offset: 0xA8 */
 __IO uint32_t DFLTIER;        /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;        /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 __IO uint32_t OECCR;          /*!< MDF Offset Error Compensation Control Register, Address offset: 0xB4 */
 __IO uint32_t SADCR;          /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;        /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;       /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;       /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t     RESERVED1[9];    /*!< Reserved, 0xC8-0xE8                                                  */
 __IO uint32_t SNPSDR;         /*!< MDF Snapshot Data Register,                     Address offset: 0xEC */
 __IO uint32_t DFLTDR;         /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief Power Management
  */
typedef struct
{
  __IO uint32_t CR1;             /*!< PWR control register 1                         Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< PWR control register 2                         Address offset: 0x004 */
  __IO uint32_t CR3;             /*!< PWR control register 3                         Address offset: 0x008 */
       uint32_t RESERVED0;       /*!< Reserved                                       Address offset: 0x00C */
  __IO uint32_t CR5;             /*!< PWR control register 5                         Address offset: 0x010 */
  __IO uint32_t CR6;             /*!< PWR control register 6                         Address offset: 0x014 */
  __IO uint32_t CR7;             /*!< PWR control register 7                         Address offset: 0x018 */
  __IO uint32_t CR8;             /*!< PWR control register 8                         Address offset: 0x01C */
  __IO uint32_t CR9;             /*!< PWR control register 9                         Address offset: 0x020 */
  __IO uint32_t CR10;            /*!< PWR control register 10                        Address offset: 0x024 */
  __IO uint32_t CR11;            /*!< PWR control register 11                        Address offset: 0x028 */
  __IO uint32_t CR12;            /*!< PWR control register 12                        Address offset: 0x02C */
       uint32_t RESERVED1[2];    /*!< Reserved                                       Address offset: 0x030-0x034 */
  __IO uint32_t BDCR1;           /*!< PWR backup domain control register 1           Address offset: 0x038 */
  __IO uint32_t BDCR2;           /*!< PWR backup domain control register 2           Address offset: 0x03C */
  __IO uint32_t CPU1CR;          /*!< PWR CPU1 control register                      Address offset: 0x040 */
  __IO uint32_t CPU2CR;          /*!< PWR CPU2 control register                      Address offset: 0x044 */
  __IO uint32_t CPU3CR;          /*!< PWR CPU3 control register                      Address offset: 0x048 */
  __IO uint32_t D1CR;            /*!< PWR D1 control register                        Address offset: 0x04C */
  __IO uint32_t D2CR;            /*!< PWR D2 control register                        Address offset: 0x050 */
  __IO uint32_t D3CR;            /*!< PWR D3 control register                        Address offset: 0x054 */
       uint32_t RESERVED2[2];    /*!< Reserved                                       Address offset: 0x058-0x05C */
  __IO uint32_t WKUPCR1;         /*!< PWR wake-up control register 1                 Address offset: 0x060 */
  __IO uint32_t WKUPCR2;         /*!< PWR wake-up control register 2                 Address offset: 0x064 */
  __IO uint32_t WKUPCR3;         /*!< PWR wake-up control register 3                 Address offset: 0x068 */
  __IO uint32_t WKUPCR4;         /*!< PWR wake-up control register 4                 Address offset: 0x06C */
  __IO uint32_t WKUPCR5;         /*!< PWR wake-up control register 5                 Address offset: 0x070 */
  __IO uint32_t WKUPCR6;         /*!< PWR wake-up control register 6                 Address offset: 0x074 */
       uint32_t RESERVED3[8];    /*!< Reserved                                       Address offset: 0x078-0x094 */
  __IO uint32_t D3WKUPENR;       /*!< PWR D3 wake-up enable register                 Address offset: 0x098 */
       uint32_t RESERVED4[25];   /*!< Reserved                                       Address offset: 0x09C-0x0FC */
  __IO uint32_t RSECCFGR;        /*!< PWR resource secure configuration register     Address offset: 0x100 */
  __IO uint32_t RPRIVCFGR;       /*!< PWR resource privileged configuration register Address offset: 0x104 */
  __IO uint32_t RxCIDCFGR[7];    /*!< PWR Resource 0-6 CID Configuration Registers   Address offsets 0x108-0x120 */
       uint32_t RESERVED5[23];   /*!< Reserved                                       Address offset: 0x124-0x17C */
  __IO uint32_t WIOSECCFGR;      /*!< PWR WIO secure configuration register          Address offset: 0x180 */
  __IO uint32_t WIOPRIVCFGR;     /*!< PWR WIO privileged configuration register      Address offset: 0x184 */
  __IO uint32_t WIO1CIDCFGR;     /*!< PWR WIO 1 CID configuration register           Address offset: 0x188 */
  __IO uint32_t WIO1SEMCR;       /*!< PWR WIO 1 semaphore control register           Address offset: 0x18C */
  __IO uint32_t WIO2CIDCFGR;     /*!< PWR WIO 2 CID configuration register           Address offset: 0x190 */
  __IO uint32_t WIO2SEMCR;       /*!< PWR WIO 2 semaphore control register           Address offset: 0x194 */
  __IO uint32_t WIO3CIDCFGR;     /*!< PWR WIO 3 CID configuration register           Address offset: 0x198 */
  __IO uint32_t WIO3SEMCR;       /*!< PWR WIO 3 semaphore control register           Address offset: 0x19C */
  __IO uint32_t WIO4CIDCFGR;     /*!< PWR WIO 4 CID configuration register           Address offset: 0x1A0 */
  __IO uint32_t WIO4SEMCR;       /*!< PWR WIO 4 semaphore control register           Address offset: 0x1A4 */
  __IO uint32_t WIO5CIDCFGR;     /*!< PWR WIO 5 CID configuration register           Address offset: 0x1A8 */
  __IO uint32_t WIO5SEMCR;       /*!< PWR WIO 5 semaphore control register           Address offset: 0x1AC */
  __IO uint32_t WIO6CIDCFGR;     /*!< PWR WIO 6 CID configuration register           Address offset: 0x1B0 */
  __IO uint32_t WIO6SEMCR;       /*!< PWR WIO 6 semaphore control register           Address offset: 0x1B4 */
       uint32_t RESERVED6[18];   /*!< Reserved                                       Address offset: 0x1B8-0x1FC */
  __IO uint32_t CPU1D1SR;        /*!< PWR CPU1 status register                       Address offset: 0x200 */
  __IO uint32_t CPU2D2SR;        /*!< PWR CPU2 status register                       Address offset: 0x204 */
  __IO uint32_t CPU3D3SR;        /*!< PWR CPU3 status register                       Address offset: 0x208 */
       uint32_t RESERVED7[122];  /*!< Reserved                                       Address offset: 0x20C-0x3F0 */
  __IO uint32_t VERR;            /*!< PWR VER register                               Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< PWR identifier register                        Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< PWR size identification register               Address offset: 0x3FC */
} PWR_TypeDef;

/**
  * @brief RISC Resource Isolation Slave Controller Compartment (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CIDCFGR;        /*!< RISC CID configuration register for peripheral x */
  __IO uint32_t SEMCR;          /*!< RISC Semaphore control register for peripheral x */
} RISC_Comp_TypeDef;

/**
  * @brief RISC Resource Isolation Slave Controller Peripheral (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t          CR;             /*!< RISC Control register,                                           Address offset: 0x000 */
       uint32_t          RESERVED1[3];   /*!< Reserved,                                                                  0x004-0x00C */
  __IO uint32_t          SECCFGR[6];     /*!< RISC Security configuration register x,                                    0x010-0x024 */
       uint32_t          RESERVED2[2];   /*!< Reserved,                                                                  0x028-0x02C */
  __IO uint32_t          PRIVCFGR[6];    /*!< RISC Privileged configuration register x,                                  0x030-0x044 */
       uint32_t          RESERVED3[2];   /*!< Reserved,                                                                  0x048-0x04C */
  __IO uint32_t          RCFGLOCKR[6];   /*!< RISC Resource configuration lock register x,                               0x050-0x064 */
       uint32_t          RESERVED4[38];  /*!< Reserved,                                                                  0x068-0x0FC */
       RISC_Comp_TypeDef PER[128];       /*!< RISC Compartment configuration for peripheral x                            0x100-0x4FC */
       uint32_t          RESERVED5[256]; /*!< Reserved,                                                                  0x500-0x8FC */
  __IO uint32_t          REG1ACFGR;      /*!< RISAL Region 1 subregion A configuration register,               Address offset: 0x900 */
  __IO uint32_t          RESERVED6[1];   /*!< Reserved,                                                        Address offset: 0x904 */
  __IO uint32_t          REG1BCFGR;      /*!< RISAL Region 1 subregion B configuration register,               Address offset: 0x908 */
  __IO uint32_t          RESERVED7[1];   /*!< Reserved,                                                        Address offset: 0x90C */
  __IO uint32_t          REG2ACFGR;      /*!< RISAL Region 2 subregion A configuration register,               Address offset: 0x910 */
  __IO uint32_t          RESERVED8[1];   /*!< Reserved,                                                        Address offset: 0x914 */
  __IO uint32_t          REG2BCFGR;      /*!< RISAL Region 2 subregion B configuration register,               Address offset: 0x918 */
  __IO uint32_t          RESERVED9[1];   /*!< Reserved,                                                        Address offset: 0x91C */
  __IO uint32_t          REG3ACFGR;      /*!< RISAL Region 3 subregion A configuration register,               Address offset: 0x920 */
  __IO uint32_t          REG3AADDR;      /*!< RISAL Region 3 subregion A address register,                     Address offset: 0x924 */
  __IO uint32_t          REG3BCFGR;      /*!< RISAL Region 3 subregion B configuration register,               Address offset: 0x928 */
  __IO uint32_t          REG3BADDR;      /*!< RISAL Region 3 subregion B address register,                     Address offset: 0x92C */
} RISC_TypeDef;

