zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255fxx_cm0.h
/*******************  Bit definition for EXTI1_CmIMR2 register  *******************/
#define EXTI1_IMR2_IM32_Pos         (0U)
#define EXTI1_IMR2_IM32_Msk         (0x1UL << EXTI1_IMR2_IM32_Pos)                /*!< 0x00000001 */
#define EXTI1_IMR2_IM32             EXTI1_IMR2_IM32_Msk                          /*!< Interrupt Mask on line 32 */
#define EXTI1_IMR2_IM33_Pos         (1U)
#define EXTI1_IMR2_IM33_Msk         (0x1UL << EXTI1_IMR2_IM33_Pos)                /*!< 0x00000002 */
#define EXTI1_IMR2_IM33             EXTI1_IMR2_IM33_Msk                          /*!< Interrupt Mask on line 33 */
#define EXTI1_IMR2_IM34_Pos         (2U)
#define EXTI1_IMR2_IM34_Msk         (0x1UL << EXTI1_IMR2_IM34_Pos)                /*!< 0x00000004 */
#define EXTI1_IMR2_IM34             EXTI1_IMR2_IM34_Msk                          /*!< Interrupt Mask on line 34 */
/* No interrupt line 35 */
#define EXTI1_IMR2_IM36_Pos         (4U)
#define EXTI1_IMR2_IM36_Msk         (0x1UL << EXTI1_IMR2_IM36_Pos)                /*!< 0x00000010 */
#define EXTI1_IMR2_IM36             EXTI1_IMR2_IM36_Msk                          /*!< Interrupt Mask on line 36 */
#define EXTI1_IMR2_IM37_Pos         (5U)
#define EXTI1_IMR2_IM37_Msk         (0x1UL << EXTI1_IMR2_IM37_Pos)                /*!< 0x00000020 */
#define EXTI1_IMR2_IM37             EXTI1_IMR2_IM37_Msk                          /*!< Interrupt Mask on line 37 */
#define EXTI1_IMR2_IM38_Pos         (6U)
#define EXTI1_IMR2_IM38_Msk         (0x1UL << EXTI1_IMR2_IM38_Pos)                /*!< 0x00000040 */
#define EXTI1_IMR2_IM38             EXTI1_IMR2_IM38_Msk                          /*!< Interrupt Mask on line 38 */
#define EXTI1_IMR2_IM39_Pos         (7U)
#define EXTI1_IMR2_IM39_Msk         (0x1UL << EXTI1_IMR2_IM39_Pos)                /*!< 0x00000080 */
#define EXTI1_IMR2_IM39             EXTI1_IMR2_IM39_Msk                          /*!< Interrupt Mask on line 39 */
#define EXTI1_IMR2_IM40_Pos         (8U)
#define EXTI1_IMR2_IM40_Msk         (0x1UL << EXTI1_IMR2_IM40_Pos)                /*!< 0x00000100 */
#define EXTI1_IMR2_IM40             EXTI1_IMR2_IM40_Msk                          /*!< Interrupt Mask on line 40 */
#define EXTI1_IMR2_IM41_Pos         (9U)
#define EXTI1_IMR2_IM41_Msk         (0x1UL << EXTI1_IMR2_IM41_Pos)                /*!< 0x00000200 */
#define EXTI1_IMR2_IM41             EXTI1_IMR2_IM41_Msk                          /*!< Interrupt Mask on line 41 */
#define EXTI1_IMR2_IM42_Pos         (10U)
#define EXTI1_IMR2_IM42_Msk         (0x1UL << EXTI1_IMR2_IM42_Pos)                /*!< 0x00000400 */
#define EXTI1_IMR2_IM42             EXTI1_IMR2_IM42_Msk                          /*!< Interrupt Mask on line 42 */
#define EXTI1_IMR2_IM43_Pos         (11U)
#define EXTI1_IMR2_IM43_Msk         (0x1UL << EXTI1_IMR2_IM43_Pos)                /*!< 0x00000800 */
#define EXTI1_IMR2_IM43             EXTI1_IMR2_IM43_Msk                          /*!< Interrupt Mask on line 43 */
#define EXTI1_IMR2_IM44_Pos         (12U)
#define EXTI1_IMR2_IM44_Msk         (0x1UL << EXTI1_IMR2_IM44_Pos)                /*!< 0x00001000 */
#define EXTI1_IMR2_IM44             EXTI1_IMR2_IM44_Msk                          /*!< Interrupt Mask on line 44 */
#define EXTI1_IMR2_IM45_Pos         (13U)
#define EXTI1_IMR2_IM45_Msk         (0x1UL << EXTI1_IMR2_IM45_Pos)                /*!< 0x00002000 */
#define EXTI1_IMR2_IM45             EXTI1_IMR2_IM45_Msk                          /*!< Interrupt Mask on line 45 */
#define EXTI1_IMR2_IM46_Pos         (14U)
#define EXTI1_IMR2_IM46_Msk         (0x1UL << EXTI1_IMR2_IM46_Pos)                /*!< 0x00004000 */
#define EXTI1_IMR2_IM46             EXTI1_IMR2_IM46_Msk                          /*!< Interrupt Mask on line 46 */
#define EXTI1_IMR2_IM47_Pos         (15U)
#define EXTI1_IMR2_IM47_Msk         (0x1UL << EXTI1_IMR2_IM47_Pos)                /*!< 0x00008000 */
#define EXTI1_IMR2_IM47             EXTI1_IMR2_IM47_Msk                          /*!< Interrupt Mask on line 47 */
#define EXTI1_IMR2_IM48_Pos         (16U)
#define EXTI1_IMR2_IM48_Msk         (0x1UL << EXTI1_IMR2_IM48_Pos)                /*!< 0x00010000 */
#define EXTI1_IMR2_IM48             EXTI1_IMR2_IM48_Msk                          /*!< Interrupt Mask on line 48 */
#define EXTI1_IMR2_IM49_Pos         (17U)
#define EXTI1_IMR2_IM49_Msk         (0x1UL << EXTI1_IMR2_IM49_Pos)                /*!< 0x00020000 */
#define EXTI1_IMR2_IM49             EXTI1_IMR2_IM49_Msk                          /*!< Interrupt Mask on line 49 */
#define EXTI1_IMR2_IM50_Pos         (18U)
#define EXTI1_IMR2_IM50_Msk         (0x1UL << EXTI1_IMR2_IM50_Pos)                /*!< 0x00040000 */
#define EXTI1_IMR2_IM50             EXTI1_IMR2_IM50_Msk                          /*!< Interrupt Mask on line 50 */
/* No interrupt line 51 */
#define EXTI1_IMR2_IM52_Pos         (20U)
#define EXTI1_IMR2_IM52_Msk         (0x1UL << EXTI1_IMR2_IM52_Pos)                /*!< 0x00100000 */
#define EXTI1_IMR2_IM52             EXTI1_IMR2_IM52_Msk                          /*!< Interrupt Mask on line 52 */
#define EXTI1_IMR2_IM53_Pos         (21U)
#define EXTI1_IMR2_IM53_Msk         (0x1UL << EXTI1_IMR2_IM53_Pos)                /*!< 0x00200000 */
#define EXTI1_IMR2_IM53             EXTI1_IMR2_IM53_Msk                          /*!< Interrupt Mask on line 53 */
#define EXTI1_IMR2_IM54_Pos         (22U)
#define EXTI1_IMR2_IM54_Msk         (0x1UL << EXTI1_IMR2_IM54_Pos)                /*!< 0x00400000 */
#define EXTI1_IMR2_IM54             EXTI1_IMR2_IM54_Msk                          /*!< Interrupt Mask on line 54 */
#define EXTI1_IMR2_IM55_Pos         (23U)
#define EXTI1_IMR2_IM55_Msk         (0x1UL << EXTI1_IMR2_IM55_Pos)                /*!< 0x00800000 */
#define EXTI1_IMR2_IM55             EXTI1_IMR2_IM55_Msk                          /*!< Interrupt Mask on line 55 */
#define EXTI1_IMR2_IM56_Pos         (24U)
#define EXTI1_IMR2_IM56_Msk         (0x1UL << EXTI1_IMR2_IM56_Pos)                /*!< 0x01000000 */
#define EXTI1_IMR2_IM56             EXTI1_IMR2_IM56_Msk                          /*!< Interrupt Mask on line 56 */
#define EXTI1_IMR2_IM57_Pos         (25U)
#define EXTI1_IMR2_IM57_Msk         (0x1UL << EXTI1_IMR2_IM57_Pos)                /*!< 0x02000000 */
#define EXTI1_IMR2_IM57             EXTI1_IMR2_IM57_Msk                          /*!< Interrupt Mask on line 57 */
/* No interrupt line 58 */
#define EXTI1_IMR2_IM59_Pos         (27U)
#define EXTI1_IMR2_IM59_Msk         (0x1UL << EXTI1_IMR2_IM59_Pos)                /*!< 0x08000000 */
#define EXTI1_IMR2_IM59             EXTI1_IMR2_IM59_Msk                          /*!< Interrupt Mask on line 59 */
#define EXTI1_IMR2_IM60_Pos         (28U)
#define EXTI1_IMR2_IM60_Msk         (0x1UL << EXTI1_IMR2_IM60_Pos)                /*!< 0x10000000 */
#define EXTI1_IMR2_IM60             EXTI1_IMR2_IM60_Msk                          /*!< Interrupt Mask on line 60 */
#define EXTI1_IMR2_IM61_Pos         (29U)
#define EXTI1_IMR2_IM61_Msk         (0x1UL << EXTI1_IMR2_IM61_Pos)                /*!< 0x20000000 */
#define EXTI1_IMR2_IM61             EXTI1_IMR2_IM61_Msk                          /*!< Interrupt Mask on line 61 */
#define EXTI1_IMR2_IM62_Pos         (30U)
#define EXTI1_IMR2_IM62_Msk         (0x1UL << EXTI1_IMR2_IM62_Pos)                /*!< 0x40000000 */
#define EXTI1_IMR2_IM62             EXTI1_IMR2_IM62_Msk                          /*!< Interrupt Mask on line 62 */
/* No interrupt line 63 */

/*******************  Bit definition for EXTI1_CmIMR3 register  *******************/
#define EXTI1_IMR3_IM64_Pos         (0U)
#define EXTI1_IMR3_IM64_Msk         (0x1UL << EXTI1_IMR3_IM64_Pos)                /*!< 0x00000001 */
#define EXTI1_IMR3_IM64             EXTI1_IMR3_IM64_Msk                          /*!< Interrupt Mask on line 64 */
#define EXTI1_IMR3_IM65_Pos         (1U)
#define EXTI1_IMR3_IM65_Msk         (0x1UL << EXTI1_IMR3_IM65_Pos)                /*!< 0x00000002 */
#define EXTI1_IMR3_IM65             EXTI1_IMR3_IM65_Msk                          /*!< Interrupt Mask on line 65 */
/* No interrupt line 66 */
#define EXTI1_IMR3_IM67_Pos         (3U)
#define EXTI1_IMR3_IM67_Msk         (0x1UL << EXTI1_IMR3_IM67_Pos)                /*!< 0x00000008 */
#define EXTI1_IMR3_IM67             EXTI1_IMR3_IM67_Msk                          /*!< Interrupt Mask on line 67 */
#define EXTI1_IMR3_IM68_Pos         (4U)
#define EXTI1_IMR3_IM68_Msk         (0x1UL << EXTI1_IMR3_IM68_Pos)                /*!< 0x00000010 */
#define EXTI1_IMR3_IM68             EXTI1_IMR3_IM68_Msk                          /*!< Interrupt Mask on line 68 */
/* No interrupt line 69 */
#define EXTI1_IMR3_IM70_Pos         (6U)
#define EXTI1_IMR3_IM70_Msk         (0x1UL << EXTI1_IMR3_IM70_Pos)                /*!< 0x00000040 */
#define EXTI1_IMR3_IM70             EXTI1_IMR3_IM70_Msk                          /*!< Interrupt Mask on line 70 */
/* No interrupt line 71 */
#define EXTI1_IMR3_IM72_Pos         (8U)
#define EXTI1_IMR3_IM72_Msk         (0x1UL << EXTI1_IMR3_IM72_Pos)                /*!< 0x00000100 */
#define EXTI1_IMR3_IM72             EXTI1_IMR3_IM72_Msk                          /*!< Interrupt Mask on line 72 */
#define EXTI1_IMR3_IM73_Pos         (9U)
#define EXTI1_IMR3_IM73_Msk         (0x1UL << EXTI1_IMR3_IM73_Pos)                /*!< 0x00000200 */
#define EXTI1_IMR3_IM73             EXTI1_IMR3_IM73_Msk                          /*!< Interrupt Mask on line 73 */
#define EXTI1_IMR3_IM74_Pos         (10U)
#define EXTI1_IMR3_IM74_Msk         (0x1UL << EXTI1_IMR3_IM74_Pos)                /*!< 0x00000400 */
#define EXTI1_IMR3_IM74             EXTI1_IMR3_IM74_Msk                          /*!< Interrupt Mask on line 74 */
#define EXTI1_IMR3_IM75_Pos         (11U)
#define EXTI1_IMR3_IM75_Msk         (0x1UL << EXTI1_IMR3_IM75_Pos)                /*!< 0x00000800 */
#define EXTI1_IMR3_IM75             EXTI1_IMR3_IM75_Msk                          /*!< Interrupt Mask on line 75 */
#define EXTI1_IMR3_IM76_Pos         (12U)
#define EXTI1_IMR3_IM76_Msk         (0x1UL << EXTI1_IMR3_IM76_Pos)                /*!< 0x00001000 */
#define EXTI1_IMR3_IM76             EXTI1_IMR3_IM76_Msk                          /*!< Interrupt Mask on line 76 */
#define EXTI1_IMR3_IM77_Pos         (13U)
#define EXTI1_IMR3_IM77_Msk         (0x1UL << EXTI1_IMR3_IM77_Pos)                /*!< 0x00002000 */
#define EXTI1_IMR3_IM77             EXTI1_IMR3_IM77_Msk                          /*!< Interrupt Mask on line 77 */
#define EXTI1_IMR3_IM78_Pos         (14U)
#define EXTI1_IMR3_IM78_Msk         (0x1UL << EXTI1_IMR3_IM78_Pos)                /*!< 0x00004000 */
#define EXTI1_IMR3_IM78             EXTI1_IMR3_IM78_Msk                          /*!< Interrupt Mask on line 78 */
#define EXTI1_IMR3_IM79_Pos         (15U)
#define EXTI1_IMR3_IM79_Msk         (0x1UL << EXTI1_IMR3_IM79_Pos)                /*!< 0x00008000 */
#define EXTI1_IMR3_IM79             EXTI1_IMR3_IM79_Msk                          /*!< Interrupt Mask on line 79 */
#define EXTI1_IMR3_IM80_Pos         (16U)
#define EXTI1_IMR3_IM80_Msk         (0x1UL << EXTI1_IMR3_IM80_Pos)                /*!< 0x00010000 */
#define EXTI1_IMR3_IM80             EXTI1_IMR3_IM80_Msk                          /*!< Interrupt Mask on line 80 */
#define EXTI1_IMR3_IM81_Pos         (17U)
#define EXTI1_IMR3_IM81_Msk         (0x1UL << EXTI1_IMR3_IM81_Pos)                /*!< 0x00020000 */
#define EXTI1_IMR3_IM81             EXTI1_IMR3_IM81_Msk                          /*!< Interrupt Mask on line 81 */
#define EXTI1_IMR3_IM82_Pos         (18U)
#define EXTI1_IMR3_IM82_Msk         (0x1UL << EXTI1_IMR3_IM82_Pos)                /*!< 0x00040000 */
#define EXTI1_IMR3_IM82             EXTI1_IMR3_IM82_Msk                          /*!< Interrupt Mask on line 82 */
#define EXTI1_IMR3_IM83_Pos         (19U)
#define EXTI1_IMR3_IM83_Msk         (0x1UL << EXTI1_IMR3_IM83_Pos)                /*!< 0x00040000 */
#define EXTI1_IMR3_IM83             EXTI1_IMR3_IM83_Msk                          /*!< Interrupt Mask on line 83 */
#define EXTI1_IMR3_IM84_Pos         (20U)
#define EXTI1_IMR3_IM84_Msk         (0x1UL << EXTI1_IMR3_IM84_Pos)                /*!< 0x00100000 */
#define EXTI1_IMR3_IM84             EXTI1_IMR3_IM84_Msk                          /*!< Interrupt Mask on line 84 */

/*******************  Bit definition for EXTI1_C2EMR3 register  *******************/
#define EXTI1_EMR3_EM65_Pos         (1U)
#define EXTI1_EMR3_EM65_Msk         (0x1UL << EXTI1_EMR3_EM65_Pos)                /*!< 0x00000002 */
#define EXTI1_EMR3_EM65             EXTI1_EMR3_EM65_Msk                          /*!< Interrupt Mask on line 65 */

